[
  {
    "id": 1,
    "title": "Bendin' Tube | 1972 Ford Maverick",
    "description": "This house call was a great way to put our Rogue Fabrication tubing bender to work, while helping preserve the interior of this 1972 Ford Maverick. The existing weld in cage that was ordered did not allow for installation of the back seats, but with a couple of extra bends added, the seats and interior panels will both fit without issue once the cage is fully welded in place. It might not look like much, but once the car is complete, that cage will be essential-with a hopped up 427 under the hood pushing over 5x the factory rated horsepower, it'll finally have the ability to get out of its own way for the first time since '72! Stay tuned for more updates, something tells us this is just the first of many fab-related projects we will be doing for this perfectly preserved gem of a '70s American engineered shitbox.",
    "image": "project1.png",
    "url": "https://youtu.be/T5fi5Bkn5qk?si=-aMfZfOsV3oU-ZR9",
    "created_at": "2024-11-10 04:40:16.572974",
    "updated_at": "2024-11-10 04:40:16.572974",
    "featured": true
  },
  {
    "id": 2,
    "title": "Bendin' Tube | 1964 Ford Falcon",
    "description": "It's a lot easier to build when there's no floor to get in the way! In all seriousness, this wasn't the first project we tackled for our longtime friend and fellow Pickled Pirate, Jason, but as always, we were glad to lend a hand on the Falcon where it counted most. Dusting off the Rogue Fab tubing bender was a highlight, and even better was knowing we helped get it racing at the Estranged Drags this year. Check out our Videos section for event highlights. And yes - don't worry - the floor was installed before it hit the track!",
    "image": "project2.png",
    "url": "https://youtu.be/T5fi5Bkn5qk?si=-aMfZfOsV3oU-ZR9&t=425",
    "created_at": "2024-11-10 04:40:16.577547",
    "updated_at": "2024-11-10 04:40:16.577547",
    "featured": true
  },
  {
    "id": 3,
    "title": "Full Build | WJ Cherokee",
    "description": "We started with a stock 1999 Jeep Grand Cherokee and went big from there. Up front, we managed to make 18-inch coilovers 'fit' alongside a high-pinion Dana 44. In the rear, a 4-linked Ford 9-inch axle with a custom-built truss and Fox air shocks also 'fit' pretty nicely. Some other highlights include chromoly axle shafts all around, 42-inch tires with beadlocks, and a custom-length reinforced rear driveshaft. Check out the 'break'-in run in our Videos section!",
    "image": "project3.png",
    "url": "https://youtu.be/Zrfsuu33IYI?si=nnvu2SxkSpUFX1Y7",
    "created_at": "2024-11-10 04:40:16.581298",
    "updated_at": "2024-11-10 04:40:16.581298",
    "featured": true
  },
  {
    "id": 34,
    "title": "Bendin' Tube | 1955 Chevrolet Bel Air",
    "description": "Putting our Rogue Fab Tubing Bender to the test once again on this '55. It certainly delivered on this project with some bends on the door bars to complement the OEM bench seat. The door bars are proving to be quite a neat feature in relation to this build, and we're beyond happy with the final result. Let us know what you think!",
    "image": "project4.png",
    "url": "https://youtu.be/T5fi5Bkn5qk?si=74E4fIX2sIFvlByl&t=542",
    "created_at": "2025-02-12 06:27:59.96199",
    "updated_at": "2025-02-12 06:33:04.725443",
    "featured": true
  },
  {
    "id": 67,
    "title": "Riverdale Swap Meet Minibike Build",
    "description": "Picked up this bare frame at the Riverdale swap meet and built it pretty much from the ground up. It's running a Harbor Freight Predator 212cc motor with a relocated fuel tank, functional rear brake, and a kill switch moved up to the handlebars. Required some custom fab work to get everything to fit cleanly. Parts from GoPowerSports.com finished it out, and now it absolutely rips.",
    "image": "project5.png",
    "url": "https://www.closeenoughfabrication.com/",
    "created_at": "2025-10-03 18:31:25.950508",
    "updated_at": "2025-10-03 18:31:25.950508",
    "featured": true
  }
]
